using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _06.PriorityQueue
{
	/******************************************************************************
	 * 힙 (Heap)
	 * 
	 * 부모 노드가 항상 자식노드보다 우선순위가 높은 속성을 만족하는 트리기반의 자료구조
	 * 많은 자료 중 우선순위가 가장 높은 요소를 빠르게 가져오기 위해 사용
	 * 
	 *   <Heap 상태> : 자식보다 부모의 값이 더 높은 상태
	 *  	  2
	 *    12     30
	 *  24  13 34  53
	 * "힙에서 가장 작은 데이터를 갖는 노드는 루트 노드이다."
	 ******************************************************************************/
	// 상승작용 중 한번의 비교로 절반의 비교 과정을 무시해도 된다.
	// 배열 기반의 자료구조이다.
	internal class heap
	{
	}
}